workspace/poc/API_Template/API_TemplateConfigs/src/main/synapse-config/api/BSCS_Sample_Dynamic_API.xml

<?xml version="1.0" encoding="UTF-8"?>
<api context="/BSCS/GenericApi" name="BSCS_Sample_Dynamic_API" xmlns="http://ws.apache.org/ns/synapse">
    <resource faultSequence="FaultSequence" methods="POST GET">
        <inSequence>
            <propertyGroup>
                <property expression="json-eval($)" name="RequestPayload" scope="default" type="STRING"/>
                <property expression="get-property('MessageID')" name="uuid" scope="default" type="STRING"/>
                <property expression="substring-after(get-property('uuid'), 'urn:uuid:')" name="ReqId" scope="default" type="STRING"/>
                <property expression="get-property('SYNAPSE_REST_API')" name="Api" scope="default" type="STRING"/>
                <property expression="json-eval($.customer_id)" name="cust_id" scope="default" type="STRING"/>
            </propertyGroup>
            <payloadFactory media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:cus="http://ericsson.com/services/ws_CIL_7/customerread" xmlns:ses="http://ericsson.com/services/ws_CIL_7/sessionchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                        <soapenv:Header>
                            <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                                <wsse:UsernameToken wsu:Id="UsernameToken-05E5B20EFB7524EEE216852580645311">
                                    <wsse:Username>$1</wsse:Username>
                                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$2</wsse:Password>
                                </wsse:UsernameToken>
                            </wsse:Security>
                        </soapenv:Header>
                        <soapenv:Body>
                            <cus:customerReadRequest>
                                <!--You may enter the following 2 items in any order -->
                                <!--Optional: -->
                                <cus:inputAttributes>
                                    <!--You may enter the following 3 items in any order -->
                                    <!--Optional: -->
                                    <cus:csId>$3</cus:csId>
                                    <!--Optional: -->
                                    <!-- <cus:csIdPub>?</cus:csIdPub> -->
                                    <!--Optional: -->
                                    <!-- <cus:syncWithDb>?</cus:syncWithDb> -->
                                </cus:inputAttributes>
                                <!--Optional: -->
                                <cus:sessionChangeRequest>
                                    <!--Optional: -->
                                    <ses:values>
                                        <!--1 or more repetitions: -->
                                        <ses:item>
                                            <!--You may enter the following 2 items in any order -->
                                            <ses:key>BU_ID</ses:key>
                                            <ses:value>2</ses:value>
                                        </ses:item>
                                    </ses:values>
                                </cus:sessionChangeRequest>
                            </cus:customerReadRequest>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args>
                    <arg evaluator="xml" expression="get-property('file','wsdlUser')"/>
                    <arg evaluator="xml" expression="get-property('file','wsdlPwd')"/>
                    <arg evaluator="json" expression="$ctx:cust_id"/>
                </args>
            </payloadFactory>
            <header name="Action" scope="default" value="urn:customerRead"/>
            <call>
                <endpoint>
                    <address format="soap11" uri="$FILE:BSCSKnotServerURL">
                        <suspendOnFailure>
                            <initialDuration>-1</initialDuration>
                            <progressionFactor>-1</progressionFactor>
                            <maximumDuration>0</maximumDuration>
                        </suspendOnFailure>
                        <markForSuspension>
                            <retriesBeforeSuspension>0</retriesBeforeSuspension>
                        </markForSuspension>
                    </address>
                </endpoint>
            </call>
            <property name="messageType" scope="axis2" type="STRING" value="application/json"/>
            <property description="ResponsePayload" expression="json-eval($)" name="ResponsePayload" scope="default" type="STRING"/>
            <respond/>
        </inSequence>
        <outSequence/>
    </resource>
</api>
